{"availableTags":["JavaScript","NodeJS","VueJS","Angular8","C++","OpenGL","Java","OOP","C#","Unity3D"],"projectsData":[{"name":"Typist","desc":"Typist is a web-based racing game, where participants race against each other to finish typing a randomly-generated paragraph of text.","favourite":true,"tags":["JavaScript","NodeJS","VueJS"],"last_updated":"10th Jan 2020","img":["/assets/Typist/image3.png","/assets/Typist/image6.png","/assets/Typist/image9.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"VueJS","icon":"/assets/Tools/vue.png"},{"label":"NodeJS","icon":"/assets/Tools/node.svg"},{"label":"socket.io","icon":"/assets/Tools/socketio.svg"},{"label":"Express","icon":"/assets/Tools/express.png"},{"label":"MongoDB","icon":"/assets/Tools/mongodb.png"},{"label":"Mocha","icon":"/assets/Tools/mocha.png"}],"links":[{"label":"GitHub","url":"https://github.com/tobybessant/Typist"}],"bodyPath":"posts/typist.md","bodyContent":"<h4 id=\"skillsdeveloped\">Skills Developed</h4>\n<ul>\n<li>Full-stack web application development.</li>\n<li>Use of websockets to enable real-time status updates.</li>\n<li>Use of TDD, and a CI pipeline to ensure high-qualtiy, functional code.</li>\n<li>Developed an express API to interact with MongoDB for high-score persistence.</li>\n<li>JS Workers to ensure immediate UI feedback.</li>\n</ul>\n<h4 id=\"improvementsevaluation\">Improvements / Evaluation</h4>\n<p>Whilst I am really pleased with the application, there are a few things I would re-consider / do differently next time:</p>\n<ul>\n<li>I would ideally improve the system design around the websocket implementation. My knowledge on how socket.io would work within the system was weak, which hindered my foresight around this implementation.</li>\n<li>I will consider using ‘Vuex’, a state-management library for Vue that may have assisted with managing the player state on the client side, and triggering relevant events.</li>\n</ul>\n<h4 id=\"additionalcomments\">Additional Comments</h4>\n<p>This project is probably my favourite so far. I enjoyed working with NodeJS to drive an application to completion - using modern frameworks and libraries to create a web-based game. I am particularly proud of the simplistic UI design and websocket implementation to send live player position updates to the rest of the lobby (screenshot 2). To ensure the UI was fast I implemented JavaScript web workers to assess the user input in another process.</p>\n<p>Using TDD forced me to spend time upfront, thinking about how the application would look from a system design perspective. I now have over 100 unit tests, which are all set up to run using an Azure Pipeline - giving me a good perspective on the status of the application's functionality.</p>","slug":"Typist"},{"name":"Habitat","desc":"Habitat is a mobile application aimed at providing a communication platform for landlords and tenants to use during a tenancy. This includes managing property maintenance issues, miscellaneous house information, and contacts.","favourite":true,"tags":["Angular8","JavaScript","NodeJS"],"last_updated":"2nd Jan 2020","img":["/assets/Habitat/image1.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"NodeJS","icon":"/assets/Tools/node.svg"},{"label":"TypeScript","icon":"/assets/Tools/ts.png"},{"label":"Angular8","icon":"/assets/Tools/angular.png"},{"label":"Ionic","icon":"/assets/Tools/ionic.png"},{"label":"Cordova","icon":"/assets/Tools/cordova.png"},{"label":"Visual Studio Code","icon":"/assets/Tools/vscode.png"},{"label":"AdobeXD","icon":"/assets/Tools/xd.png"}],"links":[{"label":"Release Website","url":"https://habitat.ebrisoft.com"}],"bodyPath":"posts/habitat.md","bodyContent":"<h4 id=\"skillsdeveloped\">Skills Developed</h4>\n<ul>\n<li>Working with web technologies to produce a native mobile application.</li>\n<li>Designing and developing an abstract API layer to produce maintainable code.</li>\n<li>Building early AdobeXD prototypes for the idea.</li>\n<li>Front-end development through implementing API service classes, components, and views.</li>\n<li>Working in a small team, using agile and scrum to set, prioritise, and assign weekly tasks.</li>\n</ul>\n<h4 id=\"additionalcomments\">Additional Comments</h4>\n<p>This project was a great opportunity to collaboratively try out some new technology that my colleagues and I were raring to get our teeth into. The backend was built by my colleague using ASP.NET Core, Entity Framework, and SQLServer. We built the front end using Angular8 &amp; TypeScript, Ionic, and Cordova, to enable easy cross-platform deployment of the application. I thoroughly enjoyed working on this application, because it allowed me to utilise my web-development knowledge in a different context for a different platform. It was also my first experience using TypeScript, and using a more complex build pipeline to support multiple platforms.</p>","slug":"Habitat"},{"name":"Terrain Generation","tags":["C++","OpenGL"],"favourite":true,"last_updated":"5th Jan 2020","img":["/assets/TerrainGeneration/image1.png","/assets/TerrainGeneration/image2.png","/assets/TerrainGeneration/image3.png","/assets/TerrainGeneration/image4.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"VisualStudio","icon":"/assets/Tools/vs.png"},{"label":"C++","icon":"/assets/Tools/cplusplus.png"},{"label":"OpenGL","icon":"/assets/Tools/opengl.jpg"},{"label":"GLM","icon":"/assets/Tools/glm.png"}],"links":[{"label":"GitHub","url":"https://github.com/tobybessant/TerrainGeneration"},{"label":"YouTube Demo","url":"https://youtu.be/qH41VISRSoA?t=10"}],"bodyPath":"posts/terraingeneration.md","bodyContent":"<p>A lightweight terrain generator developed to explore the use of noise functions to generate height maps for terrain vertexes.</p>\n<h3 id=\"skillsdeveloped\">Skills Developed</h3>\n<ul>\n<li>Use of an unmanaged language, C++.</li>\n<li>Used OpenGL and associated libraries to produce realistic terrains.</li>\n<li>Use of noise functions to seed pseudo-random value generation for a terrain height-map.</li>\n<li>User input handling to allow users to interact with the application output.</li>\n<li>Integration of <a href=\"https://github.com/FastNoise\">FastNoise</a> to apply height-map values to a grid of vertexes.</li>\n<li>Applied my algorithms knowledge to generate fast and efficient vertex-updating functions to live-update the terrain on keypress events.</li>\n</ul>\n<h4 id=\"additionalcomments\">Additional Comments</h4>\n<p>I thoroughly enjoyed producing this project, as it was my first application based aroud PCG - a topic I have been interested in exploring for some time. I am proud of how well it renders terrains, and that the user can alter any of the parameters used in the terrain generation process. The user can press certain keys to alter the terrain perameters during runtime, and see the terrain update immediately. One of the challenges with this was managing the system memory, as each time I regenerated the positional data it would use an increasing amount of memory. I overcame this by editing the existing vertex heights and simply re-loading it into the GPU buffer. This project taught me how I can be conscious of a system's memory &amp; how it can affect performance.</p>","slug":"TerrainGeneration"},{"name":"Portfolio Site","tags":["JavaScript","NodeJS","VueJS"],"last_updated":"20th Feb 2020","img":["/assets/PortfolioSite/homepage.png"],"bodyPath":"posts/portfoliosite.md","bodyContent":"<h3 id=\"skillsdeveloped\">Skills Developed</h3>\n<ul>\n<li>Front end development, using VueJS to produce a client-side application.</li>\n<li>Custom compile scripts to load project details content into html for rendering.</li>\n</ul>\n<h3 id=\"additionalcomments\">Additional Comments</h3>\n<p>This project was developed as an update to my old portfolio site. My initial portfolio site was a static HTML/CSS/JS site, which prevented it from being easily extensible. Since then I have learned how to use modern JS frameworks such as VueJS &amp; Angular, which I knew would allow my website to be more maintainable. I chose to use VueJS for this site due to the fact that it is lightweight and fast to get up and running.</p>","slug":"PortfolioSite"},{"name":"Model Loader","tags":["C++","OpenGL"],"last_updated":"29th Nov 2019","img":["/assets/ModelLoader/image2.png","/assets/ModelLoader/image1.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"VisualStudio","icon":"/assets/Tools/vs.png"},{"label":"C++","icon":"/assets/Tools/cplusplus.png"},{"label":"OpenGL","icon":"/assets/Tools/opengl.jpg"},{"label":"GLM","icon":"/assets/Tools/glm.png"}],"links":[{"label":"GitHub","url":"https://github.com/tobybessant/ModelLoader"}],"bodyPath":"posts/modelloader.md","bodyContent":"<p>A console-driven model loader for rendering and viewing 3D models. Supports '.obj' and '.dae' files.</p>\n<h3 id=\"skillsdeveloped\">Skills Developed</h3>\n<ul>\n<li>Use of an unmanaged language, C++.</li>\n<li>Use of OpenGL and associated graphics libraries to render models from a file.</li>\n<li>Algorithms, to enable fast file parsing to quickly load large sets of data.</li>\n<li>Design patterns through the creation of an abstract loader interface for easy addition of new file types.</li>\n</ul>\n<h3 id=\"additionalcomments\">Additional Comments</h3>\n<p>This project was my first C++ application, which came with its challenges. Working with an unmanaged language added complexities around memory manangement,\nwhich became more challenging as the application grew. This became particularly important if the user loads larger files intno the application.</p>","slug":"ModelLoader"},{"name":"Keycard System","tags":["Java","OOP"],"last_updated":"5th Sep 2019","img":["https://www.tobybessant.co.uk/images/portfolioimages/university-room-system-img1.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"Java","icon":"/assets/Tools/java.png"},{"label":"Netbeans","icon":"/assets/Tools/netbeans.png"}],"links":[{"label":"GitHub","url":"https://github.com/tobybessant/University-Room-System"}],"bodyPath":"posts/keycardsystem.md","bodyContent":"<p>An application developed to manage room access on a virtual university campus. Supports different roles that need to access rooms at different times, in addition to an 'Emergency' mode that changes the room access states.</p>\n<h3 id=\"skillsdeveloped\">Skills Developed</h3>\n<ul>\n<li>Object Oriented Programming</li>\n<li>Design Patterns</li>\n<li>Test Driven Development</li>\n<li>Planning &amp; Design of Software</li>\n</ul>\n<h3 id=\"additionalcomments\">Additional Comments</h3>\n<p>I am proud to say that I recieved 86% for this project. This project allowed me to understand the value of object orientated programming principles such as SOLID, and design patterns such as the observer pattern to communicate state updates, and the strategy pattern to change implementation at run time. I wrote unit tests for this project, however in the last year I can look back and say that my unit testing knowledge and process has improved greatly since this project.</p>","slug":"KeycardSystem"},{"name":"The Birthday","tags":["C#","Unity3D"],"last_updated":"16th Aug 2018","img":["/assets/TheBirthday/image.png"],"tools":[{"label":"Git","icon":"/assets/Tools/git.png"},{"label":"Unity","icon":"/assets/Tools/unity.jpg"},{"label":"3DSMax","icon":"/assets/Tools/3dsmax.png"}],"links":[{"label":"GitHub","url":"https://github.com/tobybessant/The-Birthday"}],"bodyPath":"posts/thebirthday.md","bodyContent":"<p>A narrative walking-simulator where you play as a detective's assistant in 1930's London. This was my most recent experience-based Unity project, focused around the environment modelling.</p>\n<h3 id=\"skillsdeveloped\">Skills Developed</h3>\n<ul>\n<li>3D modelling using 3DSMax.</li>\n<li>C# programming.</li>\n<li>Development using the Unity3D game engine.</li>\n</ul>","slug":"TheBirthday"}]}